Mmatsnev/hc32f4a0/DeviceDriverLibrary/hc32f4a0_ddl/driver/src/hc32f4a0_usb_hcd_int.c
    gintsts.b = *(stc_bUSB_OTG_GINTSTS_t*)&bzero;  /* C-STAT */

    /* Check if HOST Mode */
    if (USB_OTG_IsHostMode(pdev))
    {
        //gintsts.d32 = USB_OTG_ReadCoreItr(pdev);  /* C-STAT */
        u32ReadCoreItrTmp = USB_OTG_ReadCoreItr(pdev);
        gintsts.b = *(stc_bUSB_OTG_GINTSTS_t*)&u32ReadCoreItrTmp;

        //if (!gintsts.d32)  /* C-STAT */
        if (*(uint32_t*)&gintsts.b)
        {
            if (gintsts.b.sofintr)
            {
                retval |= USB_OTG_USBH_handle_sof_ISR (pdev);
            }

            if (gintsts.b.rxstsqlvl)
            {
                retval |= USB_OTG_USBH_handle_rx_qlvl_ISR (pdev);
            }

            if (gintsts.b.nptxfempty)
            {
            retval |= USB_OTG_USBH_handle_nptxfempty_ISR (pdev);
            }

            if (gintsts.b.ptxfempty)
            {
                retval |= USB_OTG_USBH_handle_ptxfempty_ISR (pdev);
            }

            if (gintsts.b.hcintr)
            {
                retval |= USB_OTG_USBH_handle_hc_ISR (pdev);
            }

            if (gintsts.b.portintr)
            {
                retval |= USB_OTG_USBH_handle_port_ISR (pdev);
            }

            if (gintsts.b.disconnect)
            {
                retval |= USB_OTG_USBH_handle_Disconnect_ISR (pdev);
            }

            if (gintsts.b.incomplisoout)
            {
                retval |= USB_OTG_USBH_handle_IncompletePeriodicXfer_ISR (pdev);
            }
            if (gintsts.b.wkupintr)
            {
                retval |= USB_OTG_USBH_handle_RemoteWakeUp_ISR (pdev);
                gintsts.b.wkupintr = 1U;
                USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GINTSTS, gintsts.d32);
            }
        }
    }
    return retval;
}

#if defined ( __ICCARM__ ) /*!< IAR Compiler */
#pragma optimize = none
#endif /* __CC_ARM */
/**
 * @brief  USB_OTG_USBH_handle_hc_n_Out_ISR
 *         Handles interrupt for a specific Host Channel
 * @param  [in] pdev     Instance for USB core
 * @param  [in] num      Channel number
 * @retval Status
 */
uint32_t USB_OTG_USBH_handle_hc_n_Out_ISR (USB_OTG_CORE_HANDLE *pdev , uint32_t num)
{
    USB_OTG_HCINTn_TypeDef     hcint;
    USB_OTG_HCINTMSK_TypeDef  hcintmsk;
    USB_OTG_HC_REGS *hcreg;
    USB_OTG_HCCHAR_TypeDef     hcchar;
    uint32_t u32Tmp = 0UL;   /* C-STAT */

    hcreg = pdev->regs.HC_REGS[num];
    hcint.b = *(__IO stc_bUSB_OTG_HCINTn_t*)&USB_OTG_READ_REG32(&hcreg->HCINT);  /* C-STAT */
    hcintmsk.d32 = USB_OTG_READ_REG32(&hcreg->HCINTMSK);
    //hcint.d32 = hcint.d32 & hcintmsk.d32;   /* C-STAT */
    u32Tmp = *(uint32_t*)&hcint.b & hcintmsk.d32;
    hcint.b = *(stc_bUSB_OTG_HCINTn_t*)&u32Tmp;

    hcchar.b = *(__IO stc_bUSB_OTG_HCCHAR_t*)&USB_OTG_READ_REG32(&pdev->regs.HC_REGS[num]->HCCHAR);  /* C-STAT */

    if (hcint.b.ahberr)
    {
        CLEAR_HC_INT(hcreg ,hc_ahberr);
        UNMASK_HOST_INT_CHH (num);
    }
    else if (hcint.b.ack)
    {
        CLEAR_HC_INT(hcreg , hc_ack);
    }
    else if (hcint.b.frmovrun)
    {
        UNMASK_HOST_INT_CHH (num);
        USB_OTG_HC_Halt(pdev, (uint8_t)num);
        CLEAR_HC_INT(hcreg ,hc_frmovrun);
    }
    else if (hcint.b.xfercompl)
    {
        pdev->host.ErrCnt[num] = 0U;
        UNMASK_HOST_INT_CHH (num);
        USB_OTG_HC_Halt(pdev, (uint8_t)num);
        CLEAR_HC_INT(hcreg , hc_xfercompl);
        pdev->host.HC_Status[num] = HC_XFRC;
    }

    else if (hcint.b.stall)
    {
        CLEAR_HC_INT(hcreg, hc_stall);
        UNMASK_HOST_INT_CHH (num);
        USB_OTG_HC_Halt(pdev, (uint8_t)num);
        pdev->host.HC_Status[num] = HC_STALL;
    }

    else if (hcint.b.nak)
    {
        pdev->host.ErrCnt[num] = 0U;
        UNMASK_HOST_INT_CHH (num);
        USB_OTG_HC_Halt(pdev, (uint8_t)num);
        CLEAR_HC_INT(hcreg , hc_nak);
        pdev->host.HC_Status[num] = HC_NAK;
    }

    else if (hcint.b.xacterr)
    {
        UNMASK_HOST_INT_CHH(num);
        USB_OTG_HC_Halt(pdev, (uint8_t)num);
        pdev->host.ErrCnt[num] ++;
        pdev->host.HC_Status[num] = HC_XACTERR;
        CLEAR_HC_INT(hcreg , hc_xacterr);
    }
    else if (hcint.b.nyet)
    {
        pdev->host.ErrCnt[num] = 0U;
        UNMASK_HOST_INT_CHH(num);
        USB_OTG_HC_Halt(pdev, (uint8_t)num);
        CLEAR_HC_INT(hcreg, hc_nyet);
        pdev->host.HC_Status[num] = HC_NYET;
    }
    else if (hcint.b.datatglerr)
    {
        UNMASK_HOST_INT_CHH(num);
        USB_OTG_HC_Halt(pdev, (uint8_t)num);
        CLEAR_HC_INT(hcreg, hc_nak);
        pdev->host.HC_Status[num] = HC_DATATGLERR;

        CLEAR_HC_INT(hcreg , hc_datatglerr);
    }
    else if (hcint.b.chhltd)
    {
        MASK_HOST_INT_CHH(num);

        if(pdev->host.HC_Status[num] == HC_XFRC)
        {
            pdev->host.URB_State[num] = URB_DONE;

            if (hcchar.b.eptype == EP_TYPE_BULK)
            {
                pdev->host.hc[num].toggle_out ^= (uint8_t)1U;
            }
        }
        else if(pdev->host.HC_Status[num] == HC_NAK)
        {
            pdev->host.URB_State[num] = URB_NOTREADY;
        }
        else if(pdev->host.HC_Status[num] == HC_NYET)
        {
            if(pdev->host.hc[num].do_ping == (uint8_t)1U)
            {
                USB_OTG_HC_DoPing(pdev, (uint8_t)num);
            }
            pdev->host.URB_State[num] = URB_NOTREADY;
        }
        else if(pdev->host.HC_Status[num] == HC_STALL)
        {
            pdev->host.URB_State[num] = URB_STALL;
        }
        else if(pdev->host.HC_Status[num] == HC_XACTERR)
        {
            if (pdev->host.ErrCnt[num] == 3UL)
            {
                pdev->host.URB_State[num] = URB_ERROR;
                pdev->host.ErrCnt[num] = 0UL;
            }
        }
        else
        {
            //
        }
        CLEAR_HC_INT(hcreg, hc_chhltd);
    }
    return 1UL;
}
#if defined ( __ICCARM__ ) /*!< IAR Compiler */
#pragma optimize = none
#endif /* __CC_ARM */
/**
 * @brief  USB_OTG_USBH_handle_hc_n_In_ISR
 *         Handles interrupt for a specific Host Channel
 * @param  [in] pdev     Instance for USB core
 * @param  [in] num      Channel number
 * @retval Status
 */
uint32_t USB_OTG_USBH_handle_hc_n_In_ISR (USB_OTG_CORE_HANDLE *pdev, uint32_t num)
{
    USB_OTG_HCINTn_TypeDef     hcint;
    USB_OTG_HCINTMSK_TypeDef   hcintmsk;
    USB_OTG_HCCHAR_TypeDef     hcchar;
    USB_OTG_HCTSIZn_TypeDef    hctsiz;
    USB_OTG_HC_REGS            *hcreg;
    uint32_t u32Tmp; /* C-STAT */
    uint32_t u32eptypetmp = 0UL; /* MISRAC 2004*/

    hcreg = pdev->regs.HC_REGS[num];
    hcint.b = *(__IO stc_bUSB_OTG_HCINTn_t*)&USB_OTG_READ_REG32(&hcreg->HCINT);  /* C-STAT */
    hcintmsk.d32 = USB_OTG_READ_REG32(&hcreg->HCINTMSK);
    //hcint.d32 = hcint.d32 & hcintmsk.d32;   /* C-STAT */
    u32Tmp = *(uint32_t*)&hcint.b & hcintmsk.d32;
    hcint.b = *(stc_bUSB_OTG_HCINTn_t*)&u32Tmp;

    hcchar.b = *(__IO stc_bUSB_OTG_HCCHAR_t*)&USB_OTG_READ_REG32(&pdev->regs.HC_REGS[num]->HCCHAR);  /* C-STAT */
    hcintmsk.d32 = 0UL;

    if (hcint.b.ahberr)
    {
        CLEAR_HC_INT(hcreg ,hc_ahberr);
        UNMASK_HOST_INT_CHH (num);
    }
    else if (hcint.b.ack)
    {
        CLEAR_HC_INT(hcreg ,hc_ack);
    }
    else if (hcint.b.stall)
    {
        UNMASK_HOST_INT_CHH (num);
        pdev->host.HC_Status[num] = HC_STALL;
        CLEAR_HC_INT(hcreg , hc_nak);   /* Clear the NAK Condition */
        CLEAR_HC_INT(hcreg , hc_stall); /* Clear the STALL Condition */
        hcint.b.nak = 0U;           /* NOTE: When there is a 'stall', reset also nak,
                      else, the pdev->host.HC_Status = HC_STALL will be overwritten by 'nak' in code below */
        USB_OTG_HC_Halt(pdev, (uint8_t)num);
    }
    else if (hcint.b.datatglerr)
    {
        UNMASK_HOST_INT_CHH (num);
        USB_OTG_HC_Halt(pdev, (uint8_t)num);
        CLEAR_HC_INT(hcreg , hc_nak);
        pdev->host.HC_Status[num] = HC_DATATGLERR;
        CLEAR_HC_INT(hcreg , hc_datatglerr);
    }

    if (hcint.b.frmovrun)
    {
        UNMASK_HOST_INT_CHH (num);
        USB_OTG_HC_Halt(pdev, (uint8_t)num);
        CLEAR_HC_INT(hcreg ,hc_frmovrun);
    }
    else if (hcint.b.xfercompl)
    {
        if (pdev->cfg.dma_enable == 1U)
        {
            hctsiz.b = *(__IO stc_bUSB_OTG_HCTSIZn_t*)&USB_OTG_READ_REG32(&pdev->regs.HC_REGS[num]->HCTSIZ);  /* C-STAT */
            pdev->host.XferCnt[num] =  pdev->host.hc[num].xfer_len - hctsiz.b.xfersize;
        }

        pdev->host.HC_Status[num] = HC_XFRC;
        pdev->host.ErrCnt [num]= 0U;
        CLEAR_HC_INT(hcreg , hc_xfercompl);

        if ((hcchar.b.eptype == EP_TYPE_CTRL)||(hcchar.b.eptype == EP_TYPE_BULK))
        {
            UNMASK_HOST_INT_CHH (num);
            USB_OTG_HC_Halt(pdev, (uint8_t)num);
            CLEAR_HC_INT(hcreg , hc_nak);
            pdev->host.hc[num].toggle_in ^= (uint8_t)1U;
        }
        else if(hcchar.b.eptype == EP_TYPE_INTR)
        {
            hcchar.b.oddfrm  = 1U;
            USB_OTG_WRITE_REG32(&pdev->regs.HC_REGS[num]->HCCHAR, *(uint32_t*)&hcchar.b);   /* C-STAT */
            pdev->host.URB_State[num] = URB_DONE;
        }
        else if(hcchar.b.eptype == EP_TYPE_ISOC)
        {
            if(pdev->host.HC_Status[num] == HC_XFRC)
            {
                pdev->host.URB_State[num] = URB_DONE;
            }
        }
        else
        {
            //
        }
    }
    else if (hcint.b.chhltd)
    {
        MASK_HOST_INT_CHH (num);

