Mmatsnev/hc32f4a0/DeviceDriverLibrary/hc32f4a0_ddl/driver/src/hc32f4a0_usb_hcd_int.c
        if(pdev->host.HC_Status[num] == HC_XFRC)
        {
            pdev->host.URB_State[num] = URB_DONE;
        }

        else if (pdev->host.HC_Status[num] == HC_STALL)
        {
            pdev->host.URB_State[num] = URB_STALL;
        }
        else if(pdev->host.HC_Status[num] == HC_XACTERR)

        {
            pdev->host.ErrCnt[num] = 0U;
            pdev->host.URB_State[num] = URB_ERROR;
        }
        else if(pdev->host.HC_Status[num] == HC_DATATGLERR)
        {
            pdev->host.ErrCnt[num] = 0U;
            pdev->host.URB_State[num] = URB_ERROR;
        }
        else if(hcchar.b.eptype == EP_TYPE_INTR)
        {
            pdev->host.hc[num].toggle_in ^= (uint8_t)1U;
        }
        else
        {
            //
        }
        CLEAR_HC_INT(hcreg , hc_chhltd);
    }
    else if (hcint.b.xacterr)
    {
        UNMASK_HOST_INT_CHH(num);
        pdev->host.ErrCnt[num] ++;
        pdev->host.HC_Status[num] = HC_XACTERR;
        USB_OTG_HC_Halt(pdev, (uint8_t)num);
        CLEAR_HC_INT(hcreg, hc_xacterr);
    }
    else if (hcint.b.nak)
    {
        u32eptypetmp = hcchar.b.eptype;
        if(u32eptypetmp == EP_TYPE_INTR)
        {
            UNMASK_HOST_INT_CHH(num);
            USB_OTG_HC_Halt(pdev, (uint8_t)num);
        }
        else if ((u32eptypetmp == EP_TYPE_CTRL)||(u32eptypetmp == EP_TYPE_BULK))
        {
            /* re-activate the channel  */
            hcchar.b.chen = 1U;
            hcchar.b.chdis = 0U;
            USB_OTG_WRITE_REG32(&pdev->regs.HC_REGS[num]->HCCHAR, *(uint32_t*)&hcchar.b);  /* C-STAT */
        }
        else
        {
            //
        }
        pdev->host.HC_Status[num] = HC_NAK;
        CLEAR_HC_INT(hcreg , hc_nak);
    }
    return 1UL;
}

/**
 * @}
 */

/**
 * @addtogroup USB_HCD_INT_Local_Functions USB HCD INT Local Functions
 * @{
 */

/**
 * @brief  USB_OTG_USBH_handle_rx_qlvl_ISR
 *         Handles the Rx Status Queue Level Interrupt
 * @param  [in] pdev: Instance for USB core
 * @retval status
 */
#if defined ( __ICCARM__ ) /*!< IAR Compiler */
#pragma optimize = none
#endif /* __CC_ARM */
static uint32_t USB_OTG_USBH_handle_rx_qlvl_ISR (USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_GRXFSTS_TypeDef       grxsts;
    USB_OTG_GINTMSK_TypeDef       intmsk;
    USB_OTG_HCTSIZn_TypeDef       hctsiz;
    USB_OTG_HCCHAR_TypeDef        hcchar;
    __IO uint8_t                  channelnum = 0U;
    uint32_t                      count;
    uint8_t                       u8Tmp = 0U;   /* C-STAT */
    uint8_t*                      pu8Tmp = (void  *)0U;  /* C-STAT */
    uint8_t                       u8ChannelNumTmp = 0U;  /* MISRAC 2004*/
    uint32_t                      u32Tmp;

    /* Disable the Rx Status Queue Level interrupt */
    intmsk.d32 = 0UL;
    intmsk.b.rxstsqlvl = 1U;
    USB_OTG_MODIFY_REG32( &pdev->regs.GREGS->GINTMSK, intmsk.d32, 0UL);

    u32Tmp = USB_OTG_READ_REG32(&pdev->regs.GREGS->GRXSTSP);
    grxsts.b = *(__IO stc_bUSB_OTG_GRXSTS_t*)&u32Tmp;
    channelnum = (uint8_t)grxsts.b.chnum;
    u8Tmp = channelnum;   /* C-STAT */
    hcchar.d32 = USB_OTG_READ_REG32(&pdev->regs.HC_REGS[u8Tmp]->HCCHAR);  /* C-STAT */

    switch (grxsts.b.pktsts)
    {
        case GRXSTS_PKTSTS_IN:
            /* Read the data into the host buffer. */
            pu8Tmp = pdev->host.hc[channelnum].xfer_buff;
            if ((grxsts.b.bcnt > 0U) && (pu8Tmp != (void  *)0U))
            {
                USB_OTG_ReadPacket(pdev, pdev->host.hc[channelnum].xfer_buff, (uint16_t)grxsts.b.bcnt);
                /*manage multiple Xfer */
                pdev->host.hc[grxsts.b.chnum].xfer_buff += grxsts.b.bcnt;
                pdev->host.hc[grxsts.b.chnum].xfer_count  += grxsts.b.bcnt;

                count = pdev->host.hc[channelnum].xfer_count;
                pdev->host.XferCnt[channelnum]  = count;

                u8ChannelNumTmp = channelnum;
                hctsiz.b = *(__IO stc_bUSB_OTG_HCTSIZn_t*)&USB_OTG_READ_REG32(&pdev->regs.HC_REGS[u8ChannelNumTmp]->HCTSIZ);  /* C-STAT */
                if(hctsiz.b.pktcnt > 0U)
                {
                    /* re-activate the channel when more packets are expected */
                    hcchar.b.chen = 1U;
                    hcchar.b.chdis = 0U;
                    USB_OTG_WRITE_REG32(&pdev->regs.HC_REGS[channelnum]->HCCHAR, hcchar.d32);
                }
            }
            break;

        case GRXSTS_PKTSTS_IN_XFER_COMP:
        case GRXSTS_PKTSTS_DATA_TOGGLE_ERR:
        case GRXSTS_PKTSTS_CH_HALTED:
            default:
        break;
    }

    /* Enable the Rx Status Queue Level interrupt */
    intmsk.b.rxstsqlvl = 1U;
    USB_OTG_MODIFY_REG32(&pdev->regs.GREGS->GINTMSK, 0UL, intmsk.d32);
    return 1UL;
}

/**
 * @brief  USB_OTG_USBH_handle_IncompletePeriodicXfer_ISR
 *         Handles the incomplete Periodic transfer Interrupt
 * @param  [in] pdev: Instance for USB core
 * @retval status
 */
#if defined ( __ICCARM__ ) /*!< IAR Compiler */
#pragma optimize = none
#endif /* __CC_ARM */
static uint32_t USB_OTG_USBH_handle_IncompletePeriodicXfer_ISR (USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_GINTSTS_TypeDef       gintsts;
    USB_OTG_HCCHAR_TypeDef        hcchar;

    hcchar.d32 = USB_OTG_READ_REG32(&pdev->regs.HC_REGS[0]->HCCHAR);
    hcchar.b.chen = 1U;
    hcchar.b.chdis = 1U;
    USB_OTG_WRITE_REG32(&pdev->regs.HC_REGS[0]->HCCHAR, hcchar.d32);

    gintsts.d32 = 0UL;
    /* Clear interrupt */
    gintsts.b.incomplisoout = 1U;
    USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GINTSTS, gintsts.d32);

    return 1UL;
}
static uint32_t USB_OTG_USBH_handle_RemoteWakeUp_ISR (USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_HPRT0_TypeDef     port0;
    USB_OTG_PCGCCTL_TypeDef   power;

    /* Release low power mode */
    power.d32 = USB_OTG_READ_REG32(&pdev->regs.PCGCCTL);
    power.b.gatehclk = 0U;
    power.b.stoppclk = 0U;
    USB_OTG_WRITE_REG32(pdev->regs.PCGCCTL, power.d32);

    USB_OTG_BSP_mDelay(20UL);

    port0.d32 = USB_OTG_ReadHPRT0(pdev);
    port0.b.prtres = 0U;
    USB_OTG_WRITE_REG32(pdev->regs.HPRT0, port0.d32);

    return 1UL;
}

/**
 * @brief  USB_OTG_USBH_handle_hc_ISR
 *         This function indicates that one or more host channels has a pending
 * @param  [in] pdev: Instance for USB core
 * @retval status
 */
static uint32_t USB_OTG_USBH_handle_hc_ISR (USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_HAINT_TypeDef        haint;
    USB_OTG_HCCHAR_TypeDef       hcchar;
    uint32_t i = 0UL;
    uint32_t retval = 0UL;
    uint32_t u32ReadHostAllChannels_intrTmp = 0UL;  /* C-STAT */

    /* Clear appropriate bits in HCINTn to clear the interrupt bit in GINTSTS */
    //haint.d32 = USB_OTG_ReadHostAllChannels_intr(pdev);   /* C-STAT */
    u32ReadHostAllChannels_intrTmp = USB_OTG_ReadHostAllChannels_intr(pdev);
    haint.b = *(stc_bUSB_OTG_HAINT_t*)&u32ReadHostAllChannels_intrTmp;

    for (i = 0UL; i < pdev->cfg.host_channels ; i++)
    {
        if (haint.b.chint & ((uint32_t)1UL << i))
        {
            hcchar.b = *(__IO stc_bUSB_OTG_HCCHAR_t*)&USB_OTG_READ_REG32(&pdev->regs.HC_REGS[i]->HCCHAR);  /* C-STAT */

            if (hcchar.b.epdir)
            {
                retval |= USB_OTG_USBH_handle_hc_n_In_ISR (pdev, i);
            }
            else
            {
                retval |=  USB_OTG_USBH_handle_hc_n_Out_ISR (pdev, i);
            }
        }
    }
    return retval;
}

/**
 * @brief  USB_OTG_otg_hcd_handle_sof_intr
 *         Handles the start-of-frame interrupt in host mode.
 * @param  [in] pdev: Instance for USB core
 * @retval status
 */
static uint32_t USB_OTG_USBH_handle_sof_ISR (USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_GINTSTS_TypeDef      gintsts;
    gintsts.d32 = 0UL;

