Mmatsnev/hc32f4a0/DeviceDriverLibrary/hc32f4a0_ddl/driver/src/hc32f4a0_usb_hcd_int.c
    USBH_HCD_INT_fops->SOF(pdev);

    /* Clear interrupt */
    gintsts.b.sofintr = 1U;
    USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GINTSTS, gintsts.d32);

    return 1UL;
}

/**
 * @brief  USB_OTG_USBH_handle_Disconnect_ISR
 *         Handles disconnect event.
 * @param  [in] pdev: Instance for USB core
 * @retval status
 */
static uint32_t USB_OTG_USBH_handle_Disconnect_ISR (USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_GINTSTS_TypeDef      gintsts;

    gintsts.d32 = 0UL;

    USBH_HCD_INT_fops->DevDisconnected(pdev);

    /* Clear interrupt */
    gintsts.b.disconnect = 1U;
    USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GINTSTS, gintsts.d32);

    return 1UL;
}
#if defined ( __ICCARM__ ) /*!< IAR Compiler */
#pragma optimize = none
#endif /* __CC_ARM */
/**
 * @brief  USB_OTG_USBH_handle_nptxfempty_ISR
 *         Handles non periodic tx fifo empty.
 * @param  [in] pdev: Instance for USB core
 * @retval status
 */
static uint32_t USB_OTG_USBH_handle_nptxfempty_ISR (USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_GINTMSK_TypeDef      intmsk;
    USB_OTG_HNPTXSTS_TypeDef     hnptxsts;
    uint16_t                     len_words , len;

    hnptxsts.b = *(__IO stc_bUSB_OTG_HNPTXSTS_t*)&USB_OTG_READ_REG32(&pdev->regs.GREGS->GNPTXSTS);   /* C-STAT */

    len_words = (uint16_t)((pdev->host.hc[hnptxsts.b.nptxqtop_chnep].xfer_len + 3UL) / 4UL);

    while ((hnptxsts.b.nptxfspcavail > len_words)&& (pdev->host.hc[hnptxsts.b.nptxqtop_chnep].xfer_len != 0U))
    {
        len = (uint16_t)(hnptxsts.b.nptxfspcavail * 4UL);

        if (len > pdev->host.hc[hnptxsts.b.nptxqtop_chnep].xfer_len)
        {
            /* Last packet */
            len = (uint16_t)pdev->host.hc[hnptxsts.b.nptxqtop_chnep].xfer_len;

            intmsk.d32 = 0UL;
            intmsk.b.nptxfempty = 1U;
            USB_OTG_MODIFY_REG32( &pdev->regs.GREGS->GINTMSK, intmsk.d32, 0UL);
        }

        len_words = (uint16_t)((pdev->host.hc[hnptxsts.b.nptxqtop_chnep].xfer_len + 3UL) / 4UL);

        USB_OTG_WritePacket (pdev , pdev->host.hc[hnptxsts.b.nptxqtop_chnep].xfer_buff, (uint8_t)hnptxsts.b.nptxqtop_chnep, len);

        pdev->host.hc[hnptxsts.b.nptxqtop_chnep].xfer_buff  += len;
        pdev->host.hc[hnptxsts.b.nptxqtop_chnep].xfer_len   -= len;
        pdev->host.hc[hnptxsts.b.nptxqtop_chnep].xfer_count  += len;

        hnptxsts.b = *(__IO stc_bUSB_OTG_HNPTXSTS_t*)&USB_OTG_READ_REG32(&pdev->regs.GREGS->GNPTXSTS);   /* C-STAT */
    }

    return 1UL;
}
#if defined ( __ICCARM__ ) /*!< IAR Compiler */
#pragma optimize = none
#endif /* __CC_ARM */
/**
 * @brief  USB_OTG_USBH_handle_ptxfempty_ISR
 *         Handles periodic tx fifo empty
 * @param  [in] pdev: Instance for USB core
 * @retval status
 */
static uint32_t USB_OTG_USBH_handle_ptxfempty_ISR (USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_GINTMSK_TypeDef      intmsk;
    USB_OTG_HPTXSTS_TypeDef      hptxsts;
    uint16_t                     len_words , len;

    hptxsts.b = *(__IO stc_bUSB_OTG_HPTXSTS_t*)&USB_OTG_READ_REG32(&pdev->regs.HREGS->HPTXSTS); /* C-STAT */

    len_words = (uint16_t)((pdev->host.hc[hptxsts.b.ptxqtop.chnum].xfer_len + 3UL) / 4UL);

    while ((hptxsts.b.ptxfspcavail > len_words)&&(pdev->host.hc[hptxsts.b.ptxqtop.chnum].xfer_len != 0U))
    {
        len = (uint16_t)(hptxsts.b.ptxfspcavail * 4UL);

        if (len > pdev->host.hc[hptxsts.b.ptxqtop.chnum].xfer_len)
        {
            len = (uint16_t)pdev->host.hc[hptxsts.b.ptxqtop.chnum].xfer_len;
            /* Last packet */
            intmsk.d32 = 0UL;
            intmsk.b.ptxfempty = 1U;
            USB_OTG_MODIFY_REG32( &pdev->regs.GREGS->GINTMSK, intmsk.d32, 0UL);
        }

        len_words = (uint16_t)((pdev->host.hc[hptxsts.b.ptxqtop.chnum].xfer_len + 3UL) / 4UL);
        USB_OTG_WritePacket (pdev , pdev->host.hc[hptxsts.b.ptxqtop.chnum].xfer_buff, (uint8_t)hptxsts.b.ptxqtop.chnum, len);

        pdev->host.hc[hptxsts.b.ptxqtop.chnum].xfer_buff  += len;
        pdev->host.hc[hptxsts.b.ptxqtop.chnum].xfer_len   -= len;
        pdev->host.hc[hptxsts.b.ptxqtop.chnum].xfer_count  += len;

        hptxsts.b = *(__IO stc_bUSB_OTG_HPTXSTS_t*)&USB_OTG_READ_REG32(&pdev->regs.HREGS->HPTXSTS);  /* C-STAT */
    }
    return 1UL;
}

/**
 * @brief  USB_OTG_USBH_handle_port_ISR
 *         This function determines which interrupt conditions have occurred
 * @param  [in] pdev: Instance for USB core
 * @retval status
 */
#if defined ( __ICCARM__ ) /*!< IAR Compiler */
#pragma optimize = none
#endif /* __CC_ARM */
static uint32_t USB_OTG_USBH_handle_port_ISR (USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_HPRT0_TypeDef  hprt0;
    USB_OTG_HPRT0_TypeDef  hprt0_dup;
    USB_OTG_HCFG_TypeDef   hcfg;
    uint32_t do_reset = 0UL;
    uint32_t retval = 0UL;

    //hcfg.d32 = 0;    /* C-STAT */
    //hprt0.d32 = 0;   /* C-STAT */
    hprt0_dup.d32 = 0UL;

    hprt0.b = *(__IO stc_bUSB_OTG_HPRT0_t*)&USB_OTG_READ_REG32(pdev->regs.HPRT0);  /* C-STAT */
    hprt0_dup.d32 = USB_OTG_READ_REG32(pdev->regs.HPRT0);

    /* Clear the interrupt bits in GINTSTS */
    hprt0_dup.b.prtena = 0U;
    hprt0_dup.b.prtconndet = 0U;
    hprt0_dup.b.prtenchng = 0U;
    hprt0_dup.b.prtovrcurrchng = 0U;

    /* Port Connect Detected */
    if (hprt0.b.prtconndet)
    {
        hprt0_dup.b.prtconndet = 1U;
        USBH_HCD_INT_fops->DevConnected(pdev);
        retval |= 1UL;
    }

    /* Port Enable Changed */
    if (hprt0.b.prtenchng)
    {
        hprt0_dup.b.prtenchng = 1U;

        if (hprt0.b.prtena == 1U)
        {
            USBH_HCD_INT_fops->DevConnected(pdev);

            if ((hprt0.b.prtspd == HPRT0_PRTSPD_LOW_SPEED) ||
            (hprt0.b.prtspd == HPRT0_PRTSPD_FULL_SPEED))
            {
                hcfg.b = *(__IO stc_bUSB_OTG_HCFG_t*)&USB_OTG_READ_REG32(&pdev->regs.HREGS->HCFG);   /* C-STAT */

                if (hprt0.b.prtspd == HPRT0_PRTSPD_LOW_SPEED)
                {
                    //USB_OTG_WRITE_REG32(&pdev->regs.HREGS->HFIR, 6000UL );
                    if (hcfg.b.fslspclksel != HCFG_6_MHZ)
                    {
                        if(pdev->cfg.phy_itface  == USB_OTG_EMBEDDED_PHY)
                        {
                            //USB_OTG_InitFSLSPClkSel(pdev ,HCFG_6_MHZ );
                        }
                        do_reset = 1U;
                    }
                }
                else
                {
                    USB_OTG_WRITE_REG32(&pdev->regs.HREGS->HFIR, 48000UL );
                    if (hcfg.b.fslspclksel != HCFG_48_MHZ)
                    {
                        USB_OTG_InitFSLSPClkSel(pdev ,HCFG_48_MHZ );
                        do_reset = 1U;
                    }
                }
            }
            else
            {
                do_reset = 1U;
            }
        }
    }
    /* Overcurrent Change Interrupt */
    if (hprt0.b.prtovrcurrchng)
    {
        hprt0_dup.b.prtovrcurrchng = 1U;
        retval |= 1UL;
    }
    if (do_reset)
    {
        //USB_OTG_ResetPort(pdev);
    }
    /* Clear Port Interrupts */
    USB_OTG_WRITE_REG32(pdev->regs.HPRT0, hprt0_dup.d32);

    return retval;
}

/**
 * @}
 */

#endif /* DDL_USBFS_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
